Revit 2026 API

# ZJustification Enumeration

---

The justification of the framing element in Z.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ZJustification
```
```vb
Public Enumeration ZJustification
```
```cpp
public enum class ZJustification
```
```fsharp
type ZJustification
```

| Member name | Value | Description |
| --- | --- | --- |
| Bottom | 3 | Justification to the bottom of the element. |
| Center | 1 | Justification to the geometrical center of element. |
| Origin | 2 | Justification to the origin of the element. |
| Top | 0 | Justification to the top of the element. |

#### Reference

Autodesk.Revit.DB.Structure Namespace